---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle
source: html/ea2b6aa1-9174-4f95-17f9-f75496564de0.htm
---
# AnalysisDisplayStyle Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.